narrative.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+OPTIONS: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+OPTIONS: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+TITLE: Narrative
#+DATE: <2017-12-07 Thu>
#+AUTHOR: Milo Cress
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 25.3.1 (Org mode 9.1.4)

#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS:
#+LATEX_HEADER:
#+LATEX_HEADER_EXTRA:
#+DESCRIPTION:
#+KEYWORDS:
#+SUBTITLE: Ross Ulbricht
#+LATEX_COMPILER: pdflatex
#+DATE: \today

#+OPTIONS: gid:nil html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t tex:t toc-tag:nil
#+OPTIONS: toc-todo:nil whn:t
#+HTML_CONTAINER: div
#+HTML_HEAD_EXTRA:
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org-mode</a> 9.1.4)
#+LATEX_HEADER:

* Prologue

 dull thrum accompanied the rhythmic shuffling of feet, muffled by the stacks of shelves the shufflers gazed at. It was a hot day, even by California standards, and the heat seemed to permeate through the walls of the library into Ross Ulbricht's soul. He was restless, and shifted his gaze from the laptop on the table in front of him to the window beside him. A patron sitting across from him at the table glanced up momentarily from her book, and buried herself once again in the fantasy world between her pages. But for Ross, escape was not an option. He searched for some breeze, some break in the stillness that stifled him. A shout behind him, followed by a crash, startled him from his reverie.

F*** you!" An elderly man shouted behind him, bellowing at a woman who was in the process of pummelling him with any object she could lay her hands on within arm's reach. Riveted as he was by this exchange, a movement in the corner of his eye brought his focus back to the table where his laptop rested -- or had rested -- until a second ago. Frantically, he called out to the woman across the table, who had snatched up his machine and was sprinting for the exit. Any chance of following her disappeared as the man and woman (who had seemingly forgotten their quarrel) piled themselves on top of Ulbricht's body. Pinned beneath them, all he could hear between his own breath and the pumping of his heart was a wheezing voice above him:

+BEGIN_QUOTE
You have the right to remain silent. Anything you say can and will be used against you in a court of law. You have the right to an attorney. If you cannot afford an attorney, one will be provided for you. Do you understand the rights I have just read to you? With these rights in mind, do you wish to speak to me?"
+END_QUOTE

n that moment, one of the most elusive and enigmatic criminals was brought to justice. The operation that brought Ulbricht to justice was painstakingly choreographed, and  That day, Ulbricht's illicit marketplace for contraband such as fake licenses and drugs, known as the Silk Road, was taken down. But how did the black market's creator, Ross Ulbricht, evolve to embrace the iconic persona of the Dread Pirate Roberts, a symbol of rebellion, libertarianism, and anonymity on the Dark Web?

* Dark Web Intro

he contents of Ross's laptop would later serve as a primary source of evidence in the case against him. Most damning of all, however, was his laptop's connection to the dark web, and to a server he rented in Iceland. This evidence could only be gathered directly from his computer because of the nature of the technology he used. Tor, for example, the service that he used to browse the web anonymously, as well as to host his black-market website, the Silk Road, not only scrambles the /contents/ of messages, but also the /source and destination/, by routing all traffic through a massive network of layered encryption. The name Tor is itself an acronym, which stands for The Onion Router, so called because all traffic enters the system encrypted in three layers. As the message traverses the network, layers are incrementally peeled off, until the message exits the network in a format intelligible to the recipient computer (such as a webpage request, or a social media post). Tracing this traffic is almost impossible because of the strong encryption the system uses, leaving governing bodies at a loss for methods to combat illicit traffic on the dark web.

articularly distressing to regulators are websites which run entirely within the Tor network. Unlike Google or Netflix, these so-called "hidden services" are designed to be completely anonymous -- both visitors and servers can interact without either knowing who the other is. This is a very powerful concept for anonymity.

+BEGIN_QUOTE
an is least himself when he talks in his own person. Give him a mask, and he will tell you the truth.
+END_QUOTE

or example, consider an activist within an oppressive government wishing to leak classified or restricted information to inform the global community. Naturally, this person would require anonymity in order to speak out, especially in a nation which punishes protest and restricts free speech. Imagine that a website has been set up by fellow dissidents within this country in order to track human rights violations committed by the regime. If the regime were able to locate the dissidents' server, they would face punishment, and the truth of the atrocities may stay buried. The power of the dark web is its ability to connect these people in an anonymous way -- at no point must the leaker reveal her identity, nor must the dissidents reveal their location.

owever, this technology had a great capacity for abuse. On the "clearnet" (any part of the web accessible via a search engine, such as [[https://google.com][Google]], sellers of drugs could only stay anonymous by keeping the address of their website hidden. The problem is, in order to get any sort of traffic or customer base, that address must be entrusted to /someone/. As the popularity of the black-market increases, so does the risk that this address falls into the hands of a law enforcement agency, who could then discover the location of the sellers' servers. This is exactly the problem that the dark web aims to solve.

lbricht was not the first person to attempt to sell drugs on the dark web. What made him successful was that he managed to solve a problem that had been the downfall of all of his predecessors -- payment. 

