narrative.org
* The Silk Road's beginnings
  The problem of payment over the internet was not a new one. Most online vendors do not even consider it a problem, because of the robust suites of electronic payment transfer that have been developed in the past decade. But vendors of illicit goods are often stymied by the very anonymity that protects them -- as linking a Paypal account, say, to their black market, or arranging a wire transfer through Western Union would drastically increase their chances of getting caught, and make it simple for authorities to trace the origin of electronic payments from source to destination. 

  The root of the problem was trust. If you can't trust someone you don't know, how can you do business with them? This was the problem that services like Paypal solve: they serve as a trusted intermediary between two parties that may not trust each other. What if you can't trust this governing body? This was the question that plagued libertarians like Ross.

  Ulbricht's libertarian free-maret ethos shaped his life and career long before he built a black-market on the Dark Web. From a young age, he pursued a means of freeing himself and others from what he believed to be a coercive tyranny. When his doctoral thesis was rejected, he turned his focus to business. Eventually, he bagan to realize that he had the power to turn his libertarian ideals into reality.

  This power came from a new and decentralized solution to the problem of trust -- Bitcoin. 

  Bitcoin maintained an honest, trustworthy system, by making each user of the system responsible for keeping the system honest. Every transaction is recorded into a ledger known as the blockchain by bitcoin "miners," in groups referred to as "blocks" (these blocks are chained together over time, hence the term "blockchain"). These miners race each other to produce new blocks, and out inconsistencies in the transactions. The first miner to calculate a complete block is rewarded a certain amount of bitcoin (12.5 at the time of writing). A new block is produced, on average, once every ten minutes.

  The genius of this idea is that an adversary who wants to subvert the system to her own ends (by modifying the transaction ledger) is forced to compete in this race against the entire legitimate bitcoin network -- who likely outnumber her in computing power by several orders of magnitude. 

  No longer were dark net markets forced to trust a governing body. Using the emerging Bitcoin technology, they were now entering into a golden age of money-transfer anonymity.

  Here, we meet Ross Ulbricht once again. This time, rather than the drug kingpin he became, he is the gregarious, geeky scientist his friends and family knew him to be. 

  But nothing seems to be going his way. His Ph.D. is rejected, the business he and his neighbor started is failing, and he's fighting with his girlfriend. The idea for a truly free market had been bouncing around in his head for some time, but it is now that this concept starts to take root. Reckoning he'll need some kind of capital to start out with, he clears out his cabin, and starts growing mushrooms (the psychedelic kind). Then, he gets to work learning the fundamentals of setting up a truly anonymous and secure dark net market. He calls it the Silk Road.

  It's hard work, and Ross's market is nowhere near paying off. His self-taught programming is starting to get him into trouble. Ross starts keeping a personal journal to record his thoughts and goals.

+BEGIN_QUOTE
rogramming now. Patchwork php mysql. Don't know how to host my own site. Didn't know how to run bitcoind. Got the basics of my site written. Launched it on freedomhosting. Announced it on the bitcointalk forums. Only a few days after launch, I got my first signups, and then my first message. I was so excited I didn't know what to do with myself. Little by little, people signed up, and vendors signed up, and then it happened. My first order. I'll never forget it. The next couple of months, I sold about 10 lbs of shrooms through my site. Some orders were as small as a gram, and others were in the qp range. Before long, I completely sold out.
+END_QUOTE

* The birth of the Dread Pirate Roberts
  As customers started to trickle into Ross's dark net market, Ross realized that for it to become the revolution he hoped it to be, he needed to create for himself a leader. The persona he created, he modeled after the movie character, the Dread Pirate Roberts, in part to add a sense of the exotic, and in part to form the basis of his legal defense -- in the movie The Princess Bride, the Dread Pirate Roberts was never one person, but rather a title passed on from master to worthy apprentice. What he created transended plausible deniability. The Dread Pirate Roberts (DPR) created became an emblem of rebellion against the government, turned buying drugs and illicit goods from a deplorable act of desperation to an honorable declaration of freedom. This charisma was Ulbricht's greatest weapon, but the inflated ego that came with it would prove his downfall.

