narrative.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Ulbricht's first mistake: Frosty stack exchange article</h2>
<div class="outline-text-2" id="text-5">
<p>
It was in 2013 that Ross made his first really big mistake. On the internet technology forum, Stack Overflow, he posted a question regarding his dark net market. 
</p>

<blockquote>
<p>
I'm trying to connect to a Tor hidden service using the following PHP code:
</p>

<div class="org-src-container">

<pre class="src src-php"><span style="color: #b2b2b2; background-color: #292b2e;">$</span><span style="color: #7590db;">url</span> = <span style="color: #2d9574;">'http://jhiwjjlqpyawmpjx.onion/'</span>
<span style="color: #b2b2b2; background-color: #292b2e;">$</span><span style="color: #7590db;">ch</span> = curl_init<span style="color: #4f97d7;">()</span>;
curl_setopt<span style="color: #4f97d7;">(</span><span style="color: #b2b2b2; background-color: #292b2e;">$</span><span style="color: #7590db;">ch</span>, <span style="color: #a45bad;">CURLOPT_URL</span>, <span style="color: #b2b2b2; background-color: #292b2e;">$</span><span style="color: #7590db;">url</span><span style="color: #4f97d7;">)</span>;
curl_setopt<span style="color: #4f97d7;">(</span><span style="color: #b2b2b2; background-color: #292b2e;">$</span><span style="color: #7590db;">ch</span>, <span style="color: #a45bad;">CURLOPT_RETURNTRANSFER</span>, <span style="color: #a45bad;">true</span><span style="color: #4f97d7;">)</span>;
curl_setopt<span style="color: #4f97d7;">(</span><span style="color: #b2b2b2; background-color: #292b2e;">$</span><span style="color: #7590db;">ch</span>, <span style="color: #a45bad;">CURLOPT_PROXY</span>, <span style="color: #2d9574;">"http://127.0.0.1:9050/"</span><span style="color: #4f97d7;">)</span>;
curl_setopt<span style="color: #4f97d7;">(</span><span style="color: #b2b2b2; background-color: #292b2e;">$</span><span style="color: #7590db;">ch</span>, <span style="color: #a45bad;">CURLOPT_PROXYTYPE</span>, <span style="color: #a45bad;">CURLPROXY_SOCKS5</span><span style="color: #4f97d7;">)</span>;
<span style="color: #b2b2b2; background-color: #292b2e;">$</span><span style="color: #7590db;">output</span> = curl_exec<span style="color: #4f97d7;">(</span><span style="color: #b2b2b2; background-color: #292b2e;">$</span><span style="color: #7590db;">ch</span><span style="color: #4f97d7;">)</span>;
<span style="color: #b2b2b2; background-color: #292b2e;">$</span><span style="color: #7590db;">curl_error</span> = curl_error<span style="color: #4f97d7;">(</span><span style="color: #b2b2b2; background-color: #292b2e;">$</span><span style="color: #7590db;">ch</span><span style="color: #4f97d7;">)</span>;
curl_close<span style="color: #4f97d7;">(</span><span style="color: #b2b2b2; background-color: #292b2e;">$</span><span style="color: #7590db;">ch</span><span style="color: #4f97d7;">)</span>;

print_r<span style="color: #4f97d7;">(</span><span style="color: #b2b2b2; background-color: #292b2e;">$</span><span style="color: #7590db;">output</span><span style="color: #4f97d7;">)</span>;
print_r<span style="color: #4f97d7;">(</span><span style="color: #b2b2b2; background-color: #292b2e;">$</span><span style="color: #7590db;">curl_error</span><span style="color: #4f97d7;">)</span>;
</pre>
</div>

<p>
When I run it, I get the following error:
</p>

<pre class="example">
Couldn't resolve host name
</pre>

<p>
However, when I run the following command from my command line in Ubuntu:
</p>

<div class="org-src-container">

<pre class="src src-shell">curl -v --socks5-hostname localhost:9050 http://jhiwjjlqpyawmpjx.onion
</pre>
</div>

<p>
I get a response as expected
</p>

<p>
The PHP cURL documentations says this:
</p>

<pre class="example">
--socks5-hostname
Use  the  specified  SOCKS5 proxy (and let the proxy resolve the host name).
</pre>
<p>
I believe the reason it works from the command line is because Tor (the proxy) is resolving the .onion hostname, which it recognizes. When running the PHP code above, my guess is that cURL or PHP is trying to resolve the .onion hostname and doesn't recognize it. I've searched for a way to tell cURL/PHP to let the proxy resolve the hostname, but I can't find a way.
</p>
</blockquote>

<p>
The trouble was, he slipped up, and used his personal email to sign up for his account.
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Ross Goes to the Dark Side</h2>
<div class="outline-text-2" id="text-6">
<p>
Ross was starting to take a dark turn in his life. Business could not have been better, and yet the ardor of fighting off hackers, and the omnipresent paranoia were starting to take a toll on him. 
</p>

<p>
His business associates, his friends, were being taken down by the authorities, one by one. Each one took with them a vital piece of the Silk Road's infrastructure. One of his lieutenants was embezzling Silk Road funds. The stress overcame him. He needed some outlet for his frustration, some sense of relief from his omnipresent guilt. 
</p>

<p>
So, he decided to deal with the one problem he could handle, using the system that he himself had built. He would kill the thief. He messaged one of his associates, Nob, a drug dealer and gangster in the area, and told him that he had a situation that required violence to resolve. What he didn't know was that Nob was not a gangster, or even a drug dealer. His name was Carl Force, and he was a DEA agent, tasked with infiltrating Ulbricht's network. Rather than expose himself as an agent, he chose to play along with the ruse. Luckily for force, the thief had been taken into custody only a few days before, and was more than cooperative with the police. So, Force doused him in tomato sauce and framed the scene to appear as a bloody homocide. Ross was seemingly convinced by the photos that Force sent, and sent him $80,000 in bitcoin.
</p>

<p>
A part of Ross knew that it was only a matter of time before he would be taken down too. But that voice of hesitance was being drowned out by his ego. He could not have achieved what he had without it. But he could not escape from the prison he had built himself without admitting that somewhere, someone was capable of finding him. This thought, in itself, was unbearable. So, day after day, he forced himself to believe that his system was secure against attackers, even when security advisers he trusted warned him of potential flaws. His system was not secure. A joint law enforcement operation had managed to hack his servers, and view the logs of his correspondence with other criminals on the network. As it turned out, he had commissioned another hit, this time on a blackmailer who claimed to have Ulbricht's identity. Ross had fallen from a radical idealist who had spoken out against the use of the dark web as a tool for harm to a hardened kingpin, set on doing anything that would keep him from facing justice.
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Closing the loop</h2>
<div class="outline-text-2" id="text-7">
<p>
The police already had the evidence they needed to trace Ulbricht to DPR and the Silk Road, but they hadn't yet made the connection. It was dumb luck that an agent assigned to investigate a small-time mushroom dealer happened across the Silk Road investigation, and drew the parallel between the user "Frosty" and the Stack Overflow article from several years before.
</p>

<p>
When the authorities took down the Silk Road, they found a small snippet of code, which perfectly matched the code that was given to him in the Stack Overflow thread.
</p>

<p>
This was compelling proof, but not enough to convict him. What they would need was a stronger link between Ross Ulbricht and his alter-ego, the Dread Pirate Roberts. His laptop, they knew, would be a trove for such information, yet there was a great risk that the encryption on the hard disk would mean that shutting the laptop's cover would almost certainly make any data on it irrecoverable without a master password that Ross would likely refuse to give. For several days, the growing Silk Road task force was at an impasse.
</p>

<p>
Then, an unexpected opportunity presented itself. Ulbricht left his home to go to the library a few blocks from where the police were stationed. Several agents entered the building after him, and set the scene for what was quite possibly the highest-stakes improv show performed. The audience was Ross Ulbricht, sitting near a window in the corner of the room, craving an escape. Escape was no longer an option.
</p>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Prologue</a></li>
<li><a href="#sec-2">2. Dark Web Intro</a></li>
<li><a href="#sec-3">3. The Silk Road's beginnings</a></li>
<li><a href="#sec-4">4. The birth of the Dread Pirate Roberts</a></li>
<li><a href="#sec-5">5. Ulbricht's first mistake: Frosty stack exchange article</a></li>
<li><a href="#sec-6">6. Ross Goes to the Dark Side</a></li>
<li><a href="#sec-7">7. Closing the loop</a></li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-12-07 Thu&gt;</span></span> \today</p>
<p class="author">Author: Milo Cress</p>
<p class="date">Created: 2017-12-20 Wed 14:47</p>
</div>
</footer>
</body>
</html>
